raceTest/Setup/Deep/OFWaves/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

option1
{
    type            verticalDamping;

    selectionMode   all;

    origin          (200 0 0);
    direction       (1 0 0);
    ramp
    {
        type        halfCosineRamp;
        start       0;
        duration    200;
    }

    lambda          0.625;

    timeStart       0;
    duration        1e6;
}


//************************************************************************* //
