raceTest/Setup/Deep/OFWaves/system/topoSetDict3
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    box;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-1e6 -1e6 -30 ) (1e6 1e6 1.5 );
        }
    }
);

// ************************************************************************* //
